diplom-result/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_Отпуска</registerRecords>
  <attributes>
    <name>ВКМ_Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-result/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
//ВКМ
	
	КоличествоДней();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВКМ_ОтпускаСотрудников

&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковВКМ_ДатаОкончанияПриИзменении(Элемент)
	
//ВКМ
	
	КоличествоДней();
	
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковВКМ_ДатаНачалаПриИзменении(Элемент)
	
//ВКМ
	
	КоличествоДней();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВКМ_АнализГрафика(Команда)
	
//ВКМ
	
	АдресВХранилище = ПоместитьВоВременноеХранилищеНаСервере();
	ПараметрыФормы = Новый Структура("АдресВХранилище", АдресВХранилище);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьВоВременноеХранилищеНаСервере()
	
//ВКМ
	
	Адрес = ПоместитьВоВременноеХранилище(Объект.ВКМ_ОтпускаСотрудников.Выгрузить( , "ВКМ_Сотрудник, ВКМ_ДатаНачала, ВКМ_ДатаОкончания"), );
	Возврат Адрес;
	
КонецФункции

&НаКлиенте
Процедура КоличествоДней()
	
//ВКМ
	
	Сотрудники = ПолучитьКоличествоДнейОтпуска();
	ПодсветкаСтрок(Сотрудники);
	
КонецПроцедуры

&НаСервере
Процедура ПодсветкаСтрок(Сотрудники)
	
//ВКМ
	
	УсловноеОформление.Элементы.Очистить();
	
	Если Сотрудники.Количество() > 0 Тогда
		Для Каждого Сотрудник Из Сотрудники Цикл
			
			ЭлементОформления = УсловноеОформление.Элементы.Добавить();
			ЭлементОформления.Использование = Истина;
			ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", webЦвета.БледноЛиловый);
			
			ЭлементУсловия = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.ВКМ_Сотрудник");
			ЭлементУсловия.ПравоеЗначение = Сотрудник;
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловия.Использование = Истина;
			
			ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ВКМ_ОтпускаСотрудников.ВКМ_Сотрудник");	
				
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоДнейОтпуска()
	
//ВКМ
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников.ВКМ_Сотрудник,
	|	ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников.ВКМ_ДатаНачала,
	|	ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников.ВКМ_ДатаОкончания
	|ПОМЕСТИТЬ ВТ_Документ
	|ИЗ
	|	&Таблица КАК ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документ.ВКМ_Сотрудник,
	|	СУММА(РАЗНОСТЬДАТ(ВТ_Документ.ВКМ_ДатаНачала, ВТ_Документ.ВКМ_ДатаОкончания, ДЕНЬ) + 1) КАК КоличествоДней
	|ИЗ
	|	ВТ_Документ КАК ВТ_Документ
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Документ.ВКМ_Сотрудник";
	
	Запрос.УстановитьПараметр("Таблица", Объект.ВКМ_ОтпускаСотрудников.Выгрузить());
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Сотрудники = Новый Массив;
	
	Пока Результат.Следующий() Цикл
		
		Если Результат.КоличествоДней > 28 Тогда
			Сотрудники.Добавить(Результат.ВКМ_Сотрудник);
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Сотрудники;
	
КонецФункции

#КонецОбласти
